"use strict"

const htmlTags = {
    "html": "Используется для создания корневого элемента документа и содержит всё содержимое веб-страницы.",
    "head": "Содержит мета-информацию о документе, такую как заголовок страницы и ссылки на внешние ресурсы.",
    "title": "Используется для установки заголовка документа, который отображается в заголовке веб-браузера или на вкладке страницы.",
    "base": "Используется для установки базового URL для всех относительных URL на странице, что полезно для указания основной директории для внешних ресурсов.",
    "link": "Используется для создания связи между документом и внешним ресурсом, таким как таблица стилей CSS.",
    "meta": "Используется для определения метаданных о документе, таких как описание страницы, ключевые слова и кодировку символов.",
    "style": "Используется для вставки стилевой информации в документ, включая CSS правила.",
    "script": "Используется для добавления встроенного JavaScript или ссылки на внешний скрипт, который добавляет функциональность на страницу.",
    "noscript": "Используется для определения содержимого, которое будет отображаться пользователям, у которых отключен JavaScript, обычно для предоставления альтернативного содержания или инструкций.",
    "body": "Содержит основное содержимое документа, такое как текст, изображения, таблицы и другие элементы.",
    "section": "Используется для определения раздела документа, который может содержать заголовок и другие элементы.",
    "header": "Используется для создания верхней части раздела или документа, часто содержит заголовок или логотип.",
    "footer": "Используется для создания нижнего колонтитула раздела или документа, часто содержит авторские права и ссылки.",
    "nav": "Используется для создания навигационного меню, обычно содержит ссылки на другие страницы сайта.",
    "article": "Используется для определения независимой статьи или контента на странице.",
    "aside": "Используется для создания боковой панели с содержанием, не прямо связанным с основным контентом.",
    "h1": "Используется для определения заголовка верхнего уровня, который обычно является самым важным заголовком на странице.",
    "h2": "Используется для создания заголовка второго уровня.",
    "h3": "Используется для создания заголовка третьего уровня и так далее, до h6.",
    "p": "Используется для создания абзаца текста.",
    "a": "Используется для создания гиперссылки, которая позволяет перейти на другую страницу или ресурс.",
    "img": "Используется для вставки изображения, которое отображается на странице.",
    "ul": "Используется для создания неупорядоченного списка, который содержит элементы списка.",
    "ol": "Используется для создания упорядоченного списка, где элементы имеют порядковые номера.",
    "li": "Используется для создания элемента списка внутри ul или ol.",
    "dl": "Используется для создания списка определений, который состоит из терминов и их определений.",
    "dt": "Используется для определения термина в списке определений.",
    "dd": "Используется для определения определения термина в списке определений.",
    "table": "Используется для создания таблицы, которая может содержать строки (tr), ячейки данных (td) и заголовки ячеек (th).",
    "tr": "Используется для создания строки в таблице.",
    "td": "Используется для создания ячейки данных в таблице.",
    "th": "Используется для создания заголовка ячейки в таблице.",
    "form": "Используется для создания формы для ввода данных, которая содержит элементы формы, такие как input и button.",
    "input": "Используется для создания поля ввода, которое может быть текстовым полем, чекбоксом, радиокнопкой и др.",
    "textarea": "Используется для создания многострочного поля ввода для ввода текста.",
    "button": "Используется для создания кнопки, которая может быть использована для отправки формы или выполнения других действий.",
    "select": "Используется для создания выпадающего списка, который позволяет выбирать один или несколько вариантов из списка.",
    "label": "Используется для создания метки для элемента формы, которая обычно связывает метку с полем ввода.",
    "fieldset": "Используется для создания группы элементов формы, которая может содержать описание и рамку.",
    "legend": "Используется для создания заголовка для элемента fieldset.",
    "div": "Тег <div> представляет собой блочный контейнер, который используется для группировки и структурирования элементов веб-страницы. Он не несет никакого собственного семантического значения и используется преимущественно для стилизации и оформления содержимого страницы с помощью CSS.",
    "span": "Тег <span> является строчным контейнером и используется для выделения или обертывания небольших фрагментов текста или других элементов внутри строки. Он также используется в сочетании с CSS для применения стилей к отдельным частям текста или элементов."
}

let table = document.querySelector('.tags')
let input = document.querySelector('.input')

function printTag() {
    let input_value = input.value.toLowerCase()

    let rows = document.querySelector('.tag__row')
    if (rows) {
        rows.remove()
    }

    if (input_value.length > 0) {
        if (htmlTags[input_value]) {
            let tr = document.createElement('tr')
            tr.classList.add('tag__row')

            let td = document.createElement('td')
            td.classList.add('tag__cell')
            td.textContent = input_value
            tr.appendChild(td)

            let td_1 = document.createElement('td')
            td_1.classList.add('tag__cell')
            td_1.textContent = htmlTags[input_value]
            tr.appendChild(td_1)

            table.appendChild(tr)
        } else {
            alert(`Тег не был найден`)
        }
        
    }

}

input.addEventListener('keyup', e => {
    if (e.key === 'Enter') {
        printTag()
    }
})

